package HW.Homework2;

public class Main {public static void main(String[] args) {
//        1 уровень сложности: 1) В методе main инициализировать 3 переменные примитивного типа и вывести на консоль результат выполнения операций + - *  / %.
//        2) Дано трехзначное число. Вывести на экран все цифры этого числа
//        Пример: 345
//        Вывод в консоль: Число 345 -> 3, 4, 5

    int num = 345;
    System.out.println(num + " -> " + ( num / 100 ) + ", " + ((num % 100) / 10 ) + ", " + ( num % 10 ));
}
}

